# Exerxises 1

3) Create a function named get_db_url. 

It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [126]:
import pandas as pd
from sqlalchemy import text, create_engine
import numpy as np
from env import get_connection
from pydataset import data

In [127]:
def get_db_url(database):
    return get_connection(database)

4) Use your function to obtain a connection to the employees database.

In [176]:
url = get_db_url('employees')

In [177]:
engine =  create_engine(url)

5) Once you have successfully run a query:

In [96]:
query = '''
        SELECT *
        FROM employees
        '''

In [97]:
text_query = text(query)

In [98]:
df = pd.read_sql(text(query), engine.connect())
df.head(10)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
2   10003  1959-12-03      Parto    Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian    Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi   Maliniak      M  1989-09-12
5   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
6   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10
7   10008  1958-02-19     Saniya   Kalloufi      M  1994-09-15
8   10009  1952-04-19     Sumant       Peac      F  1985-02-18
9   10010  1963-06-01  Duangkaew   Piveteau      F  1989-08-24

# A.
Intentionally make a typo in the database url. What kind of error message do you see?

OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'somerville_2278'@'%%' to database 'emploees'")

(Background on this error at: https://sqlalche.me/e/14/e3q8)

# B. 
Intentionally make an error in your SQL query. What does the error message look like?

ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.emploees' doesn't exist")

[SQL: 
        Select *
        From emploees
        ]
        
(Background on this error at: https://sqlalche.me/e/14/f405)

6) Read the employees and titles tables into two separate DataFrames.

In [99]:
query = '''
        SELECT *
        FROM employees
        '''

In [100]:
employees_df = pd.read_sql(text_query, engine.connect())
employees_df.head(10)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
2   10003  1959-12-03      Parto    Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian    Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi   Maliniak      M  1989-09-12
5   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
6   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10
7   10008  1958-02-19     Saniya   Kalloufi      M  1994-09-15
8   10009  1952-04-19     Sumant       Peac      F  1985-02-18
9   10010  1963-06-01  Duangkaew   Piveteau      F  1989-08-24

In [101]:
query = '''
        SELECT *
        FROM titles
        '''

In [102]:
titles_df = pd.read_sql(text(query), engine.connect())
titles_df

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

7) How many rows and columns do you have in each DataFrame? Is that what you expected?

In [103]:
#employees
employees_df.shape

(300024, 6)

In [104]:
#titles
titles_df.shape

(443308, 4)

8) Display the summary statistics for each DataFrame.

In [105]:
#employees
employees_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [106]:
#titles
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

9) How many unique titles are in the titles DataFrame?

In [107]:
titles_df.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

10) What is the oldest date in the to_date column?

In [108]:
titles_df.to_date.min()

datetime.date(1985, 3, 1)

11) What is the most recent date in the to_date column?

In [109]:
titles_df.to_date.max()

datetime.date(9999, 1, 1)

# Exercises II

1) Copy the users and roles DataFrames from the examples above.

In [131]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [132]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

2) What is the result of using a right join on the DataFrames?

In [112]:
users.merge(roles, how = 'right', left_on = 'id', right_on = 'id')

   id name_x  role_id     name_y
0   1    bob      1.0      admin
1   2    joe      2.0     author
2   3  sally      3.0   reviewer
3   4   adam      3.0  commenter

3) What is the result of using an outer join on the DataFrames?

In [120]:
users.merge(roles, how = 'outer', left_on = 'id', right_on = 'id')

   id name_x  role_id     name_y
0   1    bob      1.0      admin
1   2    joe      2.0     author
2   3  sally      3.0   reviewer
3   4   adam      3.0  commenter
4   5   jane      NaN        NaN
5   6   mike      NaN        NaN

4) What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [133]:
users.drop(columns = ['id'])
roles.drop(columns = ['id']).merge(titles_df, how = 'outer', left_on = 'name', right_on = 'name')

KeyError: 'name'

5) Load the mpg dataset from PyDataset.

In [134]:
mpg = data('mpg')

6) Output and read the documentation for the mpg dataset.

In [135]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

7) How many rows and columns are in the dataset?

In [136]:
mpg.shape

(234, 11)

8) Check out your column names and perform any cleanup you may want on them.

In [137]:
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

9) Display the summary statistics for the dataset.

In [138]:
round(mpg.describe())

       displ    year    cyl    cty    hwy
count  234.0   234.0  234.0  234.0  234.0
mean     3.0  2004.0    6.0   17.0   23.0
std      1.0     5.0    2.0    4.0    6.0
min      2.0  1999.0    4.0    9.0   12.0
25%      2.0  1999.0    4.0   14.0   18.0
50%      3.0  2004.0    6.0   17.0   24.0
75%      5.0  2008.0    8.0   19.0   27.0
max      7.0  2008.0    8.0   35.0   44.0

10) How many different manufacturers are there?

In [139]:
mpg.manufacturer.nunique()

15

11) How many different models are there?

In [140]:
mpg.model.nunique()

38

12) Create a column named mileage_difference like you did in the DataFrames exercises; 

this column should contain the difference between highway and city mileage for each car.

In [141]:
mpg['mileage_difference'] = mpg.hwy - mpg.cty
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

13) Create a column named average_mileage like you did in the DataFrames exercises; 

this is the mean of the city and highway mileage.

In [142]:
mpg['average_mileage'] = (mpg.hwy + mpg.cty)/2
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

14) Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [143]:
mpg['is_automatic'] = mpg.trans.str.contains('auto')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

15) Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [144]:
round(mpg.groupby('manufacturer').average_mileage.agg('mean')).sort_values().tail(1)

manufacturer
honda    28.0
Name: average_mileage, dtype: float64

16) Do automatic or manual cars have better miles per gallon?

In [145]:
mpg['auto_or_man'] = np.where(mpg['trans'].str.startswith('a'), 'auto', 'manual')

In [146]:
#The mean of the of every auto transmission
avg_auto_mileage = round(mpg.loc[mpg['auto_or_man'] == 'auto', 'average_mileage'].mean())

In [147]:
#The mean of the of every manual transmission
avg_man_mileage = round(mpg.loc[mpg['auto_or_man'] == 'manual', 'average_mileage'].mean())

In [148]:
#Manual cars have better miles per gallon than automatic cars
avg_man_mileage > avg_auto_mileage

True

# Exercises III

1) Use your get_db_url function to help you explore the data from the chipotle database.

In [173]:
url = get_connection('chipotle')

In [174]:
engine =  create_engine(url)

In [158]:
query = '''
        SELECT *
        FROM orders
        '''

In [159]:
text_query = text(query)

In [160]:
orders = pd.read_sql(text(query), engine.connect())

In [161]:
orders.head(10)

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
5,6,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sour Cream, Guacamole, Lettuce]]",$10.98
6,7,3,1,Side of Chips,nan,$1.69
7,8,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables, Black Beans, Pinto Beans, Cheese, Sour...",$11.75
8,9,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Cheese, Sour Cream, Lettuce]]",$9.25
9,10,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto Beans, Cheese, Sour Cream, Lettuce]]",$9.25

2) What is the total price for each order?

In [163]:
orders['total_orders'] = orders.quantity * orders.item_price.str.replace('$', '').astype(float)

/var/folders/7d/j3xl67tj7_182fyw9tbm3rkm0000gn/T/ipykernel_37454/232515855.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders['total_orders'] = orders.quantity * orders.item_price.str.replace('$', '').astype(float)

In [164]:
orders.groupby('order_id').total_orders.sum()

order_id
1       11.56
2       33.96
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: total_orders, Length: 1834, dtype: float64

3) What are the most popular 3 items?

In [165]:
orders.groupby('item_name').quantity.sum().sort_values().tail(3)

item_name
Chips and Guacamole    506
Chicken Burrito        591
Chicken Bowl           761
Name: quantity, dtype: int64

4) Which item has produced the most revenue?

In [166]:
orders.item_price = orders.item_price.str.replace('$', '').astype(float)

/var/folders/7d/j3xl67tj7_182fyw9tbm3rkm0000gn/T/ipykernel_37454/3215796166.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders.item_price = orders.item_price.str.replace('$', '').astype(float)

In [167]:
orders.groupby('item_name').item_price.sum().sort_values().tail(1)

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64

5) Join the employees and titles DataFrames together.

In [168]:
employees = employees_df.merge(titles_df, how = 'inner', left_on = 'emp_no', right_on = 'emp_no')

6) For each title, find the hire date of the employee that was hired most recently with that title.

In [169]:
employees.groupby('title').from_date.max()

title
Assistant Engineer    2000-02-01
Engineer              2002-08-01
Manager               1996-08-30
Senior Engineer       2002-08-01
Senior Staff          2002-08-01
Staff                 2000-02-01
Technique Leader      2000-02-01
Name: from_date, dtype: object

7) Write the code necessary to create a cross tabulation of the number of titles by department. 

(Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [178]:
query = '''
        SELECT *
        FROM departments
        '''

In [179]:
departments_df = pd.read_sql(text(query), engine.connect())

In [180]:
query = '''
        SELECT *
        FROM dept_emp
        '''

In [182]:
dept_emp_df = pd.read_sql(text(query), engine.connect())

In [183]:
employees = employees_df.merge(dept_emp_df, how = 'inner', left_on = 'emp_no', right_on = 'emp_no')

In [184]:
employees = employees.merge(departments_df, how = 'inner', left_on = 'dept_no', right_on = 'dept_no')

In [185]:
employees = employees.merge(titles_df, how = 'inner', left_on = 'emp_no', right_on = 'emp_no')

In [186]:
employees

,emp_no,birth_date,first_name,last_name,gender,hire_date,dept_no,from_date_x,to_date_x,dept_name,title,from_date_y,to_date_y
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,d005,1986-06-26,9999-01-01,Development,Senior Engineer,1986-06-26,9999-01-01
1,10006,1953-04-20,Anneke,Preusig,F,1989-06-02,d005,1990-08-05,9999-01-01,Development,Senior Engineer,1990-08-05,9999-01-01
2,10008,1958-02-19,Saniya,Kalloufi,M,1994-09-15,d005,1998-03-11,2000-07-31,Development,Assistant Engineer,1998-03-11,2000-07-31
3,10012,1960-10-04,Patricio,Bridgland,M,1992-12-18,d005,1992-12-18,9999-01-01,Development,Engineer,1992-12-18,2000-12-18
4,10012,1960-10-04,Patricio,Bridgland,M,1992-12-18,d005,1992-12-18,9999-01-01,Development,Senior Engineer,2000-12-18,9999-01-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...
489898,499950,1964-07-15,Weidon,Gente,F,1991-06-05,d002,1999-02-02,2000-02-23,Finance,Staff,1999-02-02,2000-02-23
489899,499977,1956-06-05,Martial,Weisert,F,1996-09-17,d002,1999-12-28,9999-01-01,Finance,Staff,1999-12-28,9999-01-01
489900,499989,1954-05-26,Keiichiro,Lindqvist,M,1993-10-28,d002,1996-10-29,2001-03-07,Finance,Senior Staff,1996-10-29,2001-03-07
489901,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,d002,1993-12-27,9999-01-01,Finance,Senior Staff,1998-12-27,9999-01-01
489902,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,d002,1993-12-27,9999-01-01,Finance,Staff,1993-12-27,1998-12-27

In [187]:
pd.crosstab(employees.title, employees.dept_name)

dept_name,Customer Service,Development,Finance,Human Resources,Marketing,Production,Quality Management,Research,Sales
title,,,,,,,,,
Assistant Engineer,298,7769,0,0,0,6445,1831,378,0
Engineer,2362,58135,0,0,0,49649,13852,2986,0
Manager,4,2,2,2,2,4,4,2,2
Senior Engineer,2027,49326,0,0,0,42205,11864,2570,0
Senior Staff,13925,1247,12139,12274,13940,1270,0,11637,36191
Staff,16150,1424,13929,14342,16196,1478,0,13495,41808
Technique Leader,309,7683,0,0,0,6557,1795,393,0

In [188]:
employees.title.value_counts()

Engineer              126984
Staff                 118822
Senior Engineer       107992
Senior Staff          102623
Technique Leader       16737
Assistant Engineer     16721
Manager                   24
Name: title, dtype: int64

In [189]:
pd.crosstab(employees.title, employees.dept_name).sum(axis = 1).sort_values(ascending = False)

title
Engineer              126984
Staff                 118822
Senior Engineer       107992
Senior Staff          102623
Technique Leader       16737
Assistant Engineer     16721
Manager                   24
dtype: int64